<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"13c3883787cc31d9a553318d84bc942e0b4778634492682ad8deb1ce817c8d20","plan_job_ref":"Job Test plan target and replace #429 at https://github.com/dflook/terraform-github-actions/actions/runs/10218310680","plan_out_hash":"d1422b5a8d27a32dc6e553a5a02bc908e87d587b2783f0ccd04a7f72ff84cb82","plan_hash":"ded78ac6c0c508987c496179642605d38ad4a71d8116e037e699ade589569a8e","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "F39VjwCBNb" -> (known after apply)
!~  foreach = "xRb7evjxqs" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #429](https://github.com/dflook/terraform-github-actions/actions/runs/10218310680)